package test;

/* 小C有一张票，这张票的ID是长度为6的字符串，每个字符都是数字，他想让这个ID变成他的辛运ID，所以他就开始更改ID，每一次操作，他可以选择任意一个数字并且替换它。
   如果这个ID的前三位数字之和等于后三位数字之和，那么这个ID就是辛运的。你帮小C求一下，最少需要操作几次，能使ID变成辛运ID

        输入
        输入只有一行，是一个长度为6的字符串。

        输出
        输出这个最小操作次数

        样例输入
        000000
        样例输出
        0

        Hint
        输入样例2
        000018

        输出样例2
        1

        样例解释：将前三位任意一个改为9即可满足条件，操作数为1

        局长有N种食物，每种食物有Ai份。每天局长会吃一份食物，或者买一份食物（即每天只能进行吃或买其中的一种动作），这样过了M天
        现在局长想知道M天后第p种食物的份数排名（从大到小，相同算并列，例如3 3 2，则排名为1 1 3）

        N,M,P<=100,Ai<=1000

        输入
        第一行N M P

        第二行N个数Ai

        接下来M行，每行A i或者B i分别表示买一份食物i，吃一份食物i

        输出
        一个答案


        样例输入
        3 4 2
        5 3 1
        B 1
        A 2
        A 2
        A 3
        样例输出
        1

        温馨提示*/

public class Main {

    public static void main(){

    }
}
